export default {
    'ISFP':`
            <h3>ISFP 개요</h3>
            <p>ISFP는 MBTI 성격 유형 중 하나로, 이는 '내향적(I)' '감각적(S)' '감정형(F)' '인식형(P)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 일반적으로 세심하고, 창의적이며, 독립적인 성향을 가지고 있습니다.</p>
            <h3>ISFP의 주요 특징</h3>
            <ul>
            <li><strong>독립성:</strong> ISFP는 독립적인 사고와 행동 스타일을 가지며, 일 처리와 문제 해결 능력이 뛰어납니다.</li>
            <li><strong>창의적인 센스:</strong> ISFP는 예술적 감각이 풍부하며, 아름다운 것을 찾고 창조하는 데 뛰어납니다.</li>
            <li><strong>섬세함:</strong> ISFP는 섬세한 성격으로 주변 사람들의 감정과 입장을 잘 이해하고 존중합니다.</li>
            </ul>
            <h3>ISFP의 장점</h3>
            <ul>
            <li><strong>유연성:</strong> ISFP는 새로운 상황이나 변화에 잘 적응하며, 다양한 방법으로 문제를 해결할 수 있습니다.</li>
            <li><strong>인내심:</strong> ISFP는 주변 사람들의 문제나 감정에 대해 인내심을 갖고 있어 서로 상호 이해를 도모하는 능력이 있습니다.</li>
            <li><strong>감성적인 지지:</strong> ISFP는 뛰어난 감성 지지를 제공하며, 타인의 감정과 요구를 이해하고 돌봄을 제공하는 데 능숙합니다.</li>
            </ul>
            <h3>ISFP의 단점</h3>
            <ul>
            <li><strong>내향적 성향:</strong> ISFP는 내향적 성향으로 인해 의사소통이 적극적이지 않을 수 있습니다. 이로 인해 대인 관계에서 문제가 발생할 수 있습니다.</li>
            <li><strong>신중함의 부족:</strong> ISFP는 때로는 세심한 판단이 부족하고, 예기치 않은 문제에 부딪힐 수 있습니다.</li>
            <li><strong>의사결정에 어려움:</strong> ISFP는 일부 상황에서 명확한 의사결정을 내리기 힘들어할 수 있습니다. 이로 인해 계획이나 목표를 세우는 데 어려움을 겪을 수 있습니다.</li>
            </ul>
            `,
    'ISFJ': `
            <h3>ISFJ 개요</h3>
            <p>ISFJ는 MBTI 성격 유형 중 하나로, 이는 '내향적(I)' '감각적(S)' '감정형(F)' '판단형(J)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 일반적으로 친절하고, 세심하고, 책임감이 강한 성향을 가지고 있습니다.</p>
            <h3>ISFJ의 주요 특징</h3>
            <ul>
            <li><strong>안정 추구:</strong> ISFJ는 안정적인 환경을 선호하며, 사회의 규칙과 가치를 중요하게 생각합니다. 이들은 주어진 일을 철저히 처리하기 위해 노력합니다.</li>
            <li><strong>돌봄:</strong> ISFJ는 다른 사람들의 감정과 요구에 민감하게 반응하며, 주변 이들에게 위로와 지지를 제공하는 데 능숙합니다.</li>
            <li><strong>상세한 관심:</strong> ISFJ는 세부 사항에 주의를 기울이며, 다른 사람들이 놓치기 쉬운 부분을 캐치해내는 능력이 있습니다.</li>
            </ul>
            <h3>ISFJ의 장점</h3>
            <ul>
            <li><strong>책임감:</strong> ISFJ는 맡은 일에 대해 강한 책임감을 느끼며, 끈기와 성실함으로 업무를 완수합니다.</li>
            <li><strong>헌신적 관심:</strong> ISFJ는 가까운 사람들에게 진심 어린 관심과 돌봄을 제공하며, 이들의 필요와 요구를 충족시키기 위해 노력합니다.</li>
            <li><strong>조직적 능력:</strong> ISFJ는 체계적인 사고와 계획력을 가지고 있어 일 처리와 조직에 능숙합니다.</li>
            </ul>
            <h3>ISFJ의 단점</h3>
            <ul>
            <li><strong>과도한 겸손함:</strong> ISFJ는 경우에 따라 너무 겸손하여 자신의 능력과 업적을 제대로 인정받지 못할 수도 있습니다.</li>
            <li><strong>변화에 대한 저항성:</strong> ISFJ는 안정을 추구하기 때문에 변화에 쉽게 적응하지 못하며, 새로운 상황과 경험에 대한 두려움을 가질 수 있습니다.</li>
            <li><strong>개인의 감정 표현 어려움:</strong> ISFJ는 자신의 감정을 표현하는 데 어려움을 겪을 수 있습니다. 이로 인해 스스로에게 부정적인 영향을 주거나 대인 관계에서 문제가 발생할 수 있습니다.</li>
            </ul>
            `,
    'ISTP': `
            <h3>ISTP 개요</h3>
            <p>ISTP는 MBTI 성격 유형 중 하나로, 이는 '내향적(I)' '감각적(S)' '사고형(T)' '인식형(P)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 일반적으로 조용하고, 능숙하며, 실용적인 성향을 가지고 있습니다.</p>
            <h3>ISTP의 주요 특징</h3>
            <ul>
            <li><strong>탐구심:</strong> ISTP는 호기심이 많아 어떤 것이 원리적으로 어떻게 작동하는지 이해하려고 노력합니다. 이를 통해 그들은 문제 해결 능력이 뛰어납니다.</li>
            <li><strong>실용주의:</strong> ISTP는 상황에 맞춰 적절한 해결책이 무엇인지 잘 판단하고 실용적인 방법을 찾아 실행합니다. 이로 인해 그들은 효율적으로 일을 처리할 수 있습니다.</li>
            <li><strong>독립성:</strong> ISTP는 독립한 사고 및 행동의 스타일을 가지고 있는데, 이러한 성향은 그들이 일상적으로 독립적으로 자신과 타인을 돕는 것에 도움이 됩니다.</li>
            </ul>
            <h3>ISTP의 장점</h3>
            <ul>
            <li><strong>문제 해결 능력:</strong> ISTP는 문제에 직면했을 때 합리적이고 직관적으로 접근하여 해결책을 찾습니다. 또한 미처 발견하지 못한 해결 방안도 찾아낼 수 있습니다.</li>
            <li><strong>기술적 능력:</strong> ISTP는 원리나 기술에 대한 깊은 이해를 바탕으로 필요한 도구와 장비를 잘 다루며 종종 그들이 관심 있는 분야에서 뛰어난 기술 능력을 발휘합니다.</li>
            <li><strong>유연성:</strong> ISTP는 새로운 상황이나 변화에 빠르게 적응하며, 다양한 방법으로 문제를 해결할 수 있습니다.</li>
            </ul>
            <h3>ISTP의 단점</h3>
            <ul>
            <li><strong>감정 표현이 서툴름:</strong> ISTP는 감정 표현에 어려움을 겪고 상대방의 감정을 고려하지 못할 때가 있습니다. 이로 인해 대인 관계의 갈등이 발생할 수 있습니다.</li>
            <li><strong>장기적 계획 세우기 어려움:</strong> ISTP는 즉흥적이고 현재 지향적인 성격 때문에 장기적인 목표나 계획을 세우는 데 어려움을 겪을 수 있습니다.</li>
            <li><strong>규칙 및 제약을 싫어함:</strong> ISTP는 규칙 및 제약에 대한 저항감을 느끼며, 이러한 경향으로 인해 일 처리나 조직 내에서 문제가 발생할 수 있습니다.</li>
            </ul>
            `,
    'ISTJ':`
            <h3>ISTJ 개요</h3>
            <p>ISTJ는 MBTI 성격 유형 중 하나로, 이는 '내향적(I)' '감각적(S)' '사고형(T)' '판단형(J)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 일반적으로 조용하고, 책임감이 강하며, 사리분별력이 뛰어난 성향을 가지고 있습니다.</p>
            <h3>ISTJ의 주요 특징</h3>
            <ul>
            <li><strong>결단력:</strong> ISTJ는 효율적이고 목표 지향적으로 일을 처리하는 데 결단력을 발휘합니다. 그들은 계획을 세우고 그에 따라 신속하게 행동합니다.</li>
            <li><strong>세심함:</strong> ISTJ는 세부 사항을 중시하고 철저하게 분석하여 일을 처리합니다. 이로 인해 그들의 업무 수행 능력은 매우 높습니다.</li>
            <li><strong>신뢰성:</strong> ISTJ는 약속을 지키기를 중요하게 생각하며, 책임감이 강해 다른 사람들에게 큰 신뢰를 얻습니다.</li>
            </ul>
            <h3>ISTJ의 장점</h3>
            <ul>
            <li><strong>책임감:</strong> ISTJ는 성실하며 책임감이 강한 성향을 가지고 있어, 그들이 맡은 일에 대해서 완수하는 데 주력합니다.</li>
            <li><strong>조직적 능력:</strong> ISTJ는 체계적이고 원칙을 따르므로, 일을 조직적으로 처리하는 능력이 뛰어납니다.</li>
            <li><strong>철저한 분석:</strong> ISTJ는 주어진 정보를 꼼꼼하게 분석하고 판단하여, 합리적이고 실용적인 결론을 도출합니다.</li>
            </ul>
            <h3>ISTJ의 단점</h3>
            <ul>
            <li><strong>감정 표현의 부재:</strong> ISTJ는 감정 표현이 서툴러 주변 사람들에게 따뜻한 느낌을 주지 못할 수 있습니다. 이로 인해 대인 관계에서 어려움을 겪을 수 있습니다.</li>
            <li><strong>융통성 부족:</strong> ISTJ는 원칙을 중시하며 규칙을 철저히 따르기 때문에, 변화에 적응하는 데 상대적으로 어려움을 겪을 수 있습니다.</li>
            <li><strong>치부적 성향:</strong> ISTJ는 자신의 견해가 옳다고 믿기 쉬워, 다른 사람들의 의견을 수용하는 데 어려움을 겪을 수 있습니다. 이로 인해 의사소통 과정에서 갈등이 발생할 수 있습니다.</li>
            </ul>
            `, 
    'INFP': `
            <h3>INFP 개요</h3>
            <p>INFP는 MBTI 성격 유형 중 하나로, 이는 '내향적(I)' '직관적(N)' '감정형(F)' '판단형(P)'의 첫 글자를 따서 만든 약자입니다. INFP는 이상을 추구하고 감수성이 풍부한 성향을 가지고 있으며, 자유로운 사고와 창의력을 가지고 있습니다. 그들은 인간의 가치와 윤리적 가이드라인을 중요하게 여기며, 자기 신념을 추구하고자 합니다.</p>
            <h3>INFP의 주요 특징</h3>
            <ul>
            <li><strong>내적 가치 중시:</strong> INFP는 내적인 가치와 신념을 중요시합니다. 그들은 자유로운 사고를 추구하며, 자신의 세계관과 타인의 세계관을 깊이 고민합니다.</li>
            <li><strong>감수성과 공감:</strong> INFP는 감수성이 풍부하며, 다른 사람들의 감정에 귀기울입니다. 그들은 공감 능력이 뛰어나며, 타인의 감정에 공감하고 이해하는 데에 주력합니다.</li>
            <li><strong>창의력과 예술적 재능:</strong> INFP는 창의력과 예술적 재능을 가지고 있습니다. 그들은 자유로운 상상력과 섬세한 감각을 활용하여 예술, 문학, 음악 등의 분야에서 뛰어난 업적을 이루기도 합니다.</li>
            </ul>
            <h3>INFP의 장점</h3>
            <ul>
            <li><strong>창의력과 비전:</strong> INFP는 독창적인 아이디어를 발생시키고 문제를 다른 각도에서 바라볼 수 있습니다. 그들은 비전과 목표 달성에 대한 패기를 가지고 있으며, 새로운 방향과 해결책을 모색하는 데 능숙합니다.</li>
            <li><strong>공감과 이해력:</strong> INFP는 다른 사람들의 감정에 귀기울이고 이해하는 능력이 뛰어납니다. 그들은 타인과의 관계를 형성하고 유지하는 데에 주력하며, 이를 통해 타인에게 영감과 힘이 되기도 합니다.</li>
            <li><strong>인간성과 도덕성:</strong> INFP는 인간의 가치와 도덕적 원칙을 중요하게 여깁니다. 그들은 형평성과 정의를 추구하며, 사회적 문제에 대한 민감도를 가지고 있습니다.</li>
            </ul>
            <h3>INFP의 단점</h3>
            <ul>
            <li><strong>결정 과정의 어려움:</strong> INFP는 결정을 내리는 데에 어려움을 겪을 수 있습니다. 그들은 다양한 옵션을 고려하고 그들의 가치와 신념에 따라 선택을 하는 것을 선호합니다.</li>
            <li><strong>감정적 민감성:</strong> INFP는 감정적으로 민감한 경향이 있습니다. 그들은 타인의 감정에 민감하게 반응하고 자신의 감정을 표현하는 데에 어려움을 겪을 수 있습니다.</li>
            <li><strong>현실과의 충돌:</strong> INFP는 이상과 현실 사이에서 갈등을 겪을 수 있습니다. 그들은 자신의 이상과 원칙을 추구하고자 하지만 현실적인 제약과 충돌할 수도 있습니다.</li>
            </ul>
            `,
    'INFJ': `
            <h3>INFJ 개요</h3>
            <p>INFJ는 MBTI 성격 유형 중 하나로, 이는 '내향적(I)', '직관적(N)', '감정형(F)', '판단형(J)'의 첫 글자를 따서 만든 약자입니다. INFJ는 이해심이 깊고 통찰력이 뛰어나며, 타인을 돕고자 하는 욕구를 가지고 있습니다. 그들은 예리한 직관력과 뛰어난 공감능력을 통해 다른 사람들과 깊은 연결을 형성할 수 있습니다.</p>
            <h3>INFJ의 주요 특징</h3>
            <ul>
            <li><strong>직관적인 인식:</strong> INFJ는 직관적으로 사물과 사람의 본질을 이해하고 파악하는 능력이 뛰어납니다. 그들은 사람들의 감정과 의도를 예측하고 이해하는 데에 능숙하며, 긍정적인 변화를 위해 노력합니다.</li>
            <li><strong>감정과 공감:</strong> INFJ는 감정에 민감하며, 다른 사람들의 감정에 공감하여 공감과 지원을 제공하는 데 능력을 발휘합니다. 그들은 타인의 감정을 경청하고 이해함으로써 긍정적인 영향을 미치는 데 앞장서기도 합니다.</li>
            <li><strong>이상을 추구:</strong> INFJ는 이상적인 세계를 추구하는 동시에 타인의 성장과 복지에 대한 비전을 가지고 있습니다. 그들은 사회적 변화와 정의를 실천하기 위해 노력하며, 긍정적인 영향을 주기 위해 헌신합니다.</li>
            </ul>
            <h3>INFJ의 장점</h3>
            <ul>
            <li><strong>사회적 영향력:</strong> INFJ는 다른 사람들에게 영향을 미치고 사회적 변화를 이끌어내는 데 재능이 있습니다. 그들은 타인을 돕고 지원하며, 사회적인 문제에 민감하게 대응합니다.</li>
            <li><strong>직관력과 통찰력:</strong> INFJ는 혼자서도 복잡한 상황과 문제를 이해하고 해결하는 능력을 가지고 있습니다. 그들은 직관과 통찰력을 통해 문제의 본질을 파악하고 새로운 아이디어를 발전시킬 수 있습니다.</li>
            <li><strong>뛰어난 리더십:</strong> INFJ는 공동체를 위해 주도적인 역할을 수행하는 것에 탁월합니다. 그들은 비전을 제시하고 다른 사람들을 동기부여하여 목표를 달성하는 데 탁월한 능력을 가지고 있습니다.</li>
            </ul>
            <h3>INFJ의 단점</h3>
            <ul>
            <li><strong>과도한 감정 부담:</strong> INFJ는 다른 사람들의 감정을 민감하게 체감하는 경향이 있습니다. 이로 인해 과도한 감정 부담을 느낄 수 있고, 자신의 감정을 잘 표현하지 못할 때가 있습니다.</li>
            <li><strong>자아 희생:</strong> INFJ는 타인을 돕고 지원하는 데에 열중하는 경향이 있습니다. 때로는 자신의 필요와 욕구를 소홀히 할 수 있으며, 과도한 자기 희생에 이를 수 있습니다.</li>
            <li><strong>결정 과정의 어려움:</strong> INFJ는 다양한 가능성을 고려한 후 결정을 내리는 데 어려움을 겪을 수 있습니다. 이로 인해 결정을 미루거나 타인의 의견에 의존하기도 합니다.</li>
            </ul>
            `,
    'INTP': `
            <h3>INTP 개요</h3>
            <p>INTP는 MBTI 성격 유형 중 하나로, 이는 '내향적(I)' '직관적(N)' '사고형(T)' '인식형(P)'의 첫 글자를 따서 만든 약자입니다. INTP는 논리적인 사고와 독창성이 뛰어나며, 지적 호기심과 분석력을 가지고 있습니다. 그들은 이론적인 문제를 해결하고 새로운 아이디어를 발전시키는 데에 탁월한 능력을 가지고 있습니다.</p>
            <h3>INTP의 주요 특징</h3>
            <ul>
            <li><strong>사색적인 성향:</strong> INTP는 내향적인 성향을 가지고 있어서 자신의 내부 세계에 몰두하곤 합니다. 그들은 아이디어에 대해 깊이 생각하며, 복잡한 문제에 대한 통찰력을 발휘합니다.</li>
            <li><strong>분석과 논리:</strong> INTP는 논리적이고 분석적인 사고 방식을 가지고 있습니다. 다양한 옵션을 탐구하고 체계적으로 분석하여 가장 합리적인 결과를 추론할 수 있습니다.</li>
            <li><strong>창의성과 독창성:</strong> INTP는 독창적인 아이디어를 발생시키는데 능숙하며, 복잡한 문제를 창의적인 방법으로 해결합니다. 그들은 새로운 관점과 접근법을 통해 문제를 다루는 데 능력을 발휘합니다.</li>
            </ul>
            <h3>INTP의 장점</h3>
            <ul>
            <li><strong>뛰어난 문제 해결 능력:</strong> INTP는 복잡한 문제에 대한 해결책을 탐색하는 데에 열성을 가지고 있습니다. 그들은 문제를 조직화하고 분석하여 합리적인 결론에 이를 수 있는 능력을 가지고 있습니다.</li>
            <li><strong>비판적 사고와 분석력:</strong> INTP는 사실과 이론에 근거한 비판적 사고를 사용합니다. 그들은 유효성과 일관성을 중요시하기 때문에 주어진 정보를 철저히 분석하고 검증할 수 있습니다.</li>
            <li><strong>창의성과 혁신성:</strong> INTP는 독창적이고 창의적인 사고력을 가지고 있습니다. 그들은 새로운 아이디어를 생성하고 문제에 대한 새로운 접근법을 모색하는 데에 능숙합니다.</li>
            </ul>
            <h3>INTP의 단점</h3>
            <ul>
            <li><strong>사회적 상호작용의 어려움:</strong> INTP는 사회적인 상호작용에 어려움을 겪을 수 있습니다. 그들은 일상적인 대화나 사회적 규칙에 민감하지 않을 수 있으며, 다소 소외감을 느낄 수 있습니다.</li>
            <li><strong>결정 과정의 과유불급:</strong> INTP는 너무 많은 옵션을 탐색하고 분석함으로써 결정을 내리기 어려워하는 경향이 있습니다. 이로 인해 효율성과 목표 달성에 어려움을 겪을 수 있습니다.</li>
            <li><strong>감정 표현의 어려움:</strong> INTP는 감정 표현에 어려움을 겪을 수 있습니다. 그들은 주로 논리와 분석에 초점을 두고 감정을 잘 표현하지 못하는 경우가 있습니다.</li>
            </ul>
            `,
    'INTJ': `
        <h3>INTJ 개요</h3>
        <p>INTJ는 MBTI 성격 유형 중 하나로, 이는 '내향적(I)' '직관적(N)' '사고형(T)' '판단형(J)'의 첫 글자를 따서 만든 약자입니다. INTJ는 논리적이고 분석적이며 진지한 성향을 가지고 있습니다. 그들은 탁월한 전략과 분석력으로 문제를 해결하고 목표를 달성하는 데 탁월한 능력을 가지고 있습니다.</p>
        <h3>INTJ의 주요 특징</h3>
        <ul>
        <li><strong>전략적 사고:</strong> INTJ는 전략적이고 분석적인 사고력을 가지고 있습니다. 복잡한 문제를 해결하고 효과적인 방안을 도출하는 데 능숙합니다.</li>
        <li><strong>독립성과 자기주장:</strong> INTJ는 독립적이며 자기주장이 강합니다. 그들은 자신의 원칙과 비전에 따라 행동하며, 타인의 의견에 휘둘리지 않습니다.</li>
        <li><strong>비판적 사고:</strong> INTJ는 사실과 논리에 기반한 비판적인 사고를 가지고 있습니다. 그들은 주어진 정보를 분석하고 검토하여 최적의 결정을 내리는 경향이 있습니다.</li>
        </ul>
        <h3>INTJ의 장점</h3>
        <ul>
        <li><strong>뛰어난 문제 해결 능력:</strong> INTJ는 복잡한 문제에 대해 창의적이고 혁신적인 해결책을 도출하는 능력이 있습니다. 그들은 대체로 분석적이고 통찰력이 뛰어나기 때문에 어려운 문제를 풀기 위해 논리적인 접근법을 사용합니다.</li>
        <li><strong>비전과 목표 지향성:</strong> INTJ는 비전을 가지고 목표를 설정하고 이를 추구하는 데 집중합니다. 그들은 긴 시야를 가지고 앞으로 나아가며, 시스템적인 변화와 혁신을 이끌어내는데 기여합니다.</li>
        <li><strong>자기결정력:</strong> INTJ는 자신의 가치와 관점을 중요하게 여기며, 자기 결정에 대한 책임감을 가지고 있습니다. 그들은 자기 자신에게 충실하며, 타인의 의견에 쉽게 영향받지 않는 특징을 가지고 있습니다.</li>
        </ul>
        <h3>INTJ의 단점</h3>
        <ul>
        <li><strong>사회적 관계에서의 어려움:</strong> INTJ는 내향적인 경향이 강하기 때문에 사회적 관계에서 어려움을 겪을 수 있습니다. 그들은 자신의 공간과 시간이 필요한 경향이 있으며, 타인과의 관계를 유지하는 데 어려움을 겪을 수 있습니다.</li>
        <li><strong>과도한 비판성:</strong> INTJ는 비판적인 성향이 강할 수 있습니다. 때때로 다른 사람들의 실력이나 결정에 대해 지나치게 비판적인 태도를 취할 수 있습니다.</li>
        <li><strong>감정 표현의 어려움:</strong> INTJ는 감정 표현에 어려움을 겪을 수 있습니다. 그들은 자신의 감정을 다른 사람들과 공유하기보다는 내부적으로 체계적으로 처리하는 경향이 있습니다.</li>
        </ul>
        `,
    'ESFP': ` 
        <h3>ESFP 개요</h3> 
        <p>ESFP는 MBTI 성격 유형 중 하나로, 이는 '외향적(E)' '감각적(S)' '감정형(F)' '인식형(P)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 일반적으로 활기차고, 호기심이 많으며, 친절하고, 유쾌한 성향을 가지고 있습니다.</p> 
        <h3>ESFP의 주요 특징</h3> 
        <ul> 
        <li><strong>사교성</strong>: ESFP는 사교적이며, 다양한 사람들과 잘 어울리고 함께 즐기는 데 긍정적입니다. 그들은 유쾌하고 원기 왕성하여 주변 사람들이 편안하게 느끼게 합니다.</li> 
        <li><strong>적응력</strong>: ESFP는 변화하는 상황에 빠르게 적응하며, 그 상황을 효과적으로 다루는 능력이 있습니다. 무작정 새로운 경험을 두려워하지 않으며, 도전하는 것을 좋아합니다.</li> 
        <li><strong>감정 공감</strong>: ESFP는 주변 사람들의 감정에 큰 관심을 기울이며, 사람들에게 따뜻한 관심과 지지를 보낼 수 있는 능력이 있습니다.</li> 
        </ul> 
        <h3>ESFP의 장점</h3> 
        <ul> 
        <li><strong>활력 넘치는 에너지</strong>: ESFP는 긍정적인 에너지가 넘치며, 그들의 열정과 즐거움이 영향력 있게 주변 사람들에게 전달됩니다. 이러한 에너지는 다른 사람들로 하여금 긍정적인 감정을 느끼게 합니다.</li> 
        <li><strong>대인 관계 능력</strong>: ESFP는 대화를 즐기며, 소통 능력이 뛰어납니다. 그들은 다양한 유형의 사람들과 쉽게 어울리며 진심어린 관심을 표현하는 데 능숙합니다.</li> 
        <li><strong>융통성</strong>: ESFP는 유연하고 적응력이 뛰어납니다. 변화에 대응할 때 두려워하지 않으며, 새로운 상황에 발맞춰 주변 환경에 적응하는 능력이 높습니다.</li> 
        </ul> 
        <h3>ESFP의 단점</h3> 
        <ul> 
        <li><strong>장기 계획 세우기 어려움</strong>: ESFP는 즉흥적이며 단기적인 관점에 집중하기 때문에, 장기적인 계획을 세우고 실천하는데 어려움을 겪을 수 있습니다.</li> 
        <li><strong>감정의 기복</strong>: ESFP는 감정에 크게 휘둘리기도 하는 경향이 있어, 일시적으로 충동적인 행동을 할 수 있습니다. 이러한 기복은 그들의 의사결정 과정에 영향을 줄 수 있습니다.</li> 
        <li><strong>규칙과 제약에 대한 저항</strong>: ESFP는 규칙과 제약을 싫어하며, 이에 대한 저항감을 표출할 수 있습니다. 이로 인해 일 처리나 관계에서 문제가 발생할 수 있습니다.</li> 
        </ul>
        ` ,
    ESFJ: ` 
        <h3>ESFJ 개요</h3> 
        <p>ESFJ는 MBTI 성격 유형 중 하나로, 이는 '외향적(E)' '감각적(S)' '감정형(F)' '판단형(J)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 일반적으로 따뜻하고 다정하며, 친절하고, 사회적이고, 책임감이 강합니다.</p> 
        <h3>ESFJ의 주요 특징</h3> 
        <ul> <li><strong>사교성:</strong> ESFJ는 사교적이고 친절하며, 남을 즐겁게 해주는 데 능숙합니다. 그들은 다양한 유형의 사람들과 잘 어울리며, 친구나 동료와 함께 시간을 보내는 것을 즐깁니다.</li> 
        <li><strong>민첩성:</strong> ESFJ는 주변 환경에 민첩하게 대처하며, 다양한 상황에서 적응력을 발휘합니다. 그들은 남들의 요구와 기대에 잘 부응하려고 노력합니다.</li> <li><strong>감정 공감:</strong> ESFJ는 타인의 감정에 민감하게 반응하여, 공감 능력이 뛰어납니다. 그들은 다른 사람들의 기분을 파악하고 그에 따라 행동할 수 있는 능력을 지니고 있습니다.</li> 
        </ul> 
        <h3>ESFJ의 장점</h3> 
        <ul> 
        <li><strong>사람들을 돌보는 마음:</strong> ESFJ는 다른 사람들의 이야기를 듣고 도움을 주기 위해 노력합니다. 그들은 상대방의 말을 진지하게 고려하며, 관심과 지지를 표현하는 데 우수합니다.</li> <li><strong>조화롭게 협동하는 능력:</strong> ESFJ는 팀에서 중심이 되는 사람입니다. 그들은 협동을 중요시하며, 다른 사람들과의 관계를 소중히 생각합니다. 이로 인해 그들은 동료와 함께 일할 때 탁월한 성과를 이룰 수 있습니다.</li> <li><strong>조직력과 책임감:</strong> ESFJ는 일을 철저하게 계획하고 조직적인 방식으로 수행합니다. 그들은 일에 대한 책임감이 강하며, 정확하게 일처리를 할 수 있는 능력을 지니고 있습니다.</li> </ul> <h3>ESFJ의 단점</h3> <ul> <li><strong>비판에 민감함:</strong> ESFJ는 자신이나 가족, 친한 친구들에 대한 비판에 민감할 수 있습니다. 그들은 타인의 무난한 의견이나 비평을 거부하거나 감정적으로 받아들일 수 있습니다.</li> 
        <li><strong>남의 감정에 지나치게 신경 씀:</strong> ESFJ는 다른 사람의 기분을 상하게 할까봐 과도하게 걱정하거나 스트레스를 받을 수 있습니다. 이로 인해 그들은 자신의 감정을 무시하거나 소홀히 할 수 있습니다.</li> 
        <li><strong>변화에 대한 저항:</strong> ESFJ는 일상생활이나 일에서의 변화에 손쉽게 적응하지 못하며, 안정적인 상황을 선호합니다. 그들은 새로운 방법이나 접근법에 거부감을 느끼거나 저항할 수 있습니다.</li> 
        </ul> 
        `,
    'ESTP': ` 
        <h3>ESTP 개요</h3> 
        <p>ESTP는 MBTI 성격 유형 중 하나로, 이는 '외향적(E)' '감각적(S)' '사고형(T)' '인식형(P)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 일반적으로 다양한 경험을 추구하며, 유연하고, 실용적이고, 현실감 있고, 사회성이 높습니다.
        </p> <h3>ESTP의 주요 특징</h3> 
        <ul> 
        <li><strong>활동성:</strong> ESTP는 적극적이고 활동을 추구하는 경향이 있습니다. 그들은 새로운 경험에 열려 있으며, 주변 환경에 적응하는 능력이 탁월합니다.</li> 
        <li><strong>현실감 있는 접근:</strong> ESTP는 현실적이고 실용적인 방식으로 문제를 해결하는 경향이 있습니다. 그들은 상황에 맞게 유연하게 대처하여 실질적인 해결책을 찾는 데 능숙합니다.</li> 
        <li><strong>사회성:</strong> ESTP는 사교적이고 대인관계 능력이 뛰어납니다. 그들은 다른 사람들과 쉽게 어울리며, 의사소통이 원활하고 친화력이 강합니다.</li> 
        </ul> 
        <h3>ESTP의 장점</h3> 
        <ul> 
        <li><strong>능동적:</strong> ESTP는 기회를 찾아 나서고, 과제에 대해 적극적으로 대응하는 경향이 있습니다. 이로 인해 그들은 어려운 상황에서도 문제를 해결하는 능력이 탁월하며, 도전을 즐깁니다.</li> 
        <li><strong>유연성:</strong> ESTP는 새로운 상황이나 변화에 대응하는 능력이 뛰어납니다. 그들은 변화에 유연하게 대처하며, 효율적으로 결과를 이끌어 낼 수 있습니다.</li> <li><strong>친절함:</strong> ESTP는 사람들과 쉽게 어울리는 친화력을 가지고 있어, 다양한 관계를 쉽게 형성하며 집단의 분위기를 밝게 하는 데 기여합니다.</li> 
        </ul> 
        <h3>ESTP의 단점</h3> 
        <ul> 
        <li><strong>단기적 관점:</strong> ESTP는 때때로 너무 즉흥적이고 단기적인 접근을 취할 수 있습니다. 이로 인해 오래 지속되는 계획을 세우거나, 미래를 설계하는데 어려움을 겪을 수 있습니다.</li> 
        <li><strong>감정적 소외:</strong> ESTP는 감정적인 면에서 다소 무뚝뚝하며, 자신과 다른 사람들의 감정을 완전히 이해하지 못하는 경우가 있습니다. 이로 인해 인간관계에서 오해와 불편함을 초래할 수 있습니다.</li> 
        <li><strong>규칙 무시:</strong> ESTP는 일반적으로 규칙과 의무에 신경을 쓰지 않는 경향이 있습니다. 이로 인해 다른 사람들과 충돌을 빚거나, 안전과 관련된 문제가 발생할 수 있습니다.</li> 
        </ul> 
        `,
    'ESTJ': `
        <h3>ESTJ 개요</h3>
        <p>ESTJ는 MBTI 성격 유형 중 하나로, 이는 '외향적(E)' '감각적(S)' '사고형(T)' '판단형(J)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 일반적으로 실질적이고, 결정적이며, 책임감이 강하고, 전통적입니다.</p>
        <h3>ESTJ의 주요 특징</h3>
        <ul>
        <li><strong>책임감:</strong> ESTJ는 강한 책임감을 가지고 있습니다. 그들은 일이 잘 처리되고 제 시간에 완료되도록 하기 위해 열심히 노력합니다.</li>
        <li><strong>체계적인 생각:</strong> ESTJ는 체계적이고 논리적인 방식으로 문제를 해결하고자 합니다. 그들은 일관성과 명확성을 중요시하며, 결정을 내릴 때 사실과 현실적인 사항을 우선시합니다.</li>
        <li><strong>명확한 표현:</strong> ESTJ는 직설적이며 명확하게 자신의 생각과 의견을 표현합니다. 그들은 자신의 관점을 명확히 이해시키는 것이 중요하다고 느낍니다.</li>
        </ul>
        <h3>ESTJ의 장점</h3>
        <ul>
        <li><strong>강한 리더십:</strong> ESTJ는 그들의 직설성과 결단력 덕분에 탁월한 리더가 될 수 있습니다. 그들은 구성원들에게 분명한 지침을 제공하고, 일이 계획대로 진행되는지 확인하는 데 탁월합니다.</li>
        <li><strong>신중함:</strong> ESTJ는 철저하게 계획하고 조직화하는 데 시간을 쓰는 경향이 있습니다. 이런 성향은 그들이 잘 조직된 일정을 가지고 목표를 효과적으로 달성하는 데 도움이 됩니다.</li>
        <li><strong>신뢰성:</strong> ESTJ는 신뢰할 수 있고 책임감 있는 사람들로 알려져 있습니다. 그들은 약속을 잘 지키며, 그들에게 맡겨진 일에 최선을 다합니다.</li>
        </ul>
        <h3>ESTJ의 단점</h3>
        <ul>
        <li><strong>융통성 부족:</strong> ESTJ는 때때로 변화에 대해 융통성이 없을 수 있으며, 그들의 사고 방식이나 접근 방식이 더 나은 결과를 가져올 수 있다는 것에 대해 고집할 수 있습니다.</li>
        <li><strong>다른 사람의 감정 간과:</strong> ESTJ는 때때로 너무 사실에 집착하거나 논리적으로 생각하다 보니, 다른 사람의 감정이나 개인적인 관점을 무시하거나 간과하는 경향이 있습니다.</li>
        <li><strong>비판에 대한 감수성:</strong> ESTJ는 자신의 아이디어나 접근법에 대한 비판에 대해 민감할 수 있습니다. 그들은 종종 자신의 방식이 옳다고 확신하기 때문에, 새로운 아이디어나 제안을 받아들이는데 어려움을 겪을 수 있습니다.</li>
        </ul>
        `,
    'ENFP': `
        <h3>ENFP 개요</h3>
        <p>ENFP는 MBTI 성격 유형 중 하나로, 이는 '외향적(E)' '직관적(N)' '감정적(F)' '탐색형(P)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 일반적으로 열정적이며, 창조적이고, 사회적이며, 매우 이상주의적입니다.</p>
        <h3>ENFP의 주요 특징</h3>
        <ul>
        <li><strong>열정적이고 창조적임:</strong> ENFP는 열정적이며 창조적인 사람들로, 그들의 생각과 아이디어는 종종 독창적입니다. 그들은 새로운 가능성에 열려 있으며, 자신의 가치와 신념을 따르는 경향이 있습니다.</li>
        <li><strong>사회성:</strong> ENFP는 외향적인 성격으로, 사람들과 함께 있을 때 에너지를 얻습니다. 그들은 다양한 사람들과의 교류를 즐기며, 타인의 관점과 경험을 이해하려 노력합니다.</li>
        <li><strong>감정적인 이해력:</strong> ENFP는 감정에 민감하며, 자신과 타인의 감정을 잘 이해합니다. 그들은 감정적인 연결을 중요시하며, 대인 관계에서 깊은 의미와 목적을 찾습니다.</li>
        </ul>
        <h3>ENFP의 장점</h3>
        <ul>
        <li><strong>뛰어난 사회적 능력:</strong> ENFP는 사람들과 쉽게 친해지며, 그들의 의견과 감정을 이해하고 존중합니다. 이는 그들이 다른 사람들을 동기부여하고, 사람들 사이의 불화를 조정하는 데 탁월하다는 것을 의미합니다.</li>
        <li><strong>창조적이고 열정적:</strong> ENFP는 자신의 열정을 추구하며, 자신의 아이디어를 실현시키기 위해 노력합니다. 이는 그들이 자신의 일에 열정적으로 몰입하고, 자신의 목표를 성취하는 데 필요한 독창적인 방법을 찾아낼 수 있다는 것</li>
        <li><strong>열린 마음:</strong> ENFP는 새로운 아이디어와 경험에 대해 개방적입니다. 그들은 변화를 즐기며, 다양한 관점을 이해하려 노력합니다.</li>
        </ul>
        <h3>ENFP의 단점</h3>
        <ul>
        <li><strong>계획성 부족:</strong> ENFP는 새로운 아이디어나 계획에 쉽게 몰입할 수 있지만, 세부 사항에 대한 계획이나 조직이 부족할 수 있습니다. 때로는 시작한 일을 완료하지 못하고 다른 일로 넘어가는 경향이 있습니다.</li>
        <li><strong>과민성:</strong> ENFP는 감정적으로 민감하여, 비판이나 부정적인 피드백에 대해 강하게 반응할 수 있습니다. 이것은 그들이 스트레스를 느끼거나 상처받기 쉽다는 것을 의미합니다.</li>
        <li><strong>실현성 부족:</strong> ENFP는 종종 이상주의적인 경향이 있어, 그들의 아이디어나 계획이 현실적이지 않을 수 있습니다. 이는 그들이 자신의 목표를 달성하는 데 어려움을 겪을 수 있다는 것을 의미합니다.</li>
        </ul>
        `,
    'ENFJ': `
        <h3>ENFJ 개요</h3>
        <p>ENFJ는 MBTI 성격 유형 중 하나로, 이는 '외향적(E)' '직관적(N)' '감정적(F)' '판단형(J)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 일반적으로 따뜻하고, 장래지향적이며, 이해심이 깊고, 동정심이 많습니다.</p>
        <h3>ENFJ의 주요 특징</h3>
        <ul>
        <li><strong>사회성:</strong> ENFJ는 사람들과 함께 시간을 보내는 것을 즐기며, 다른 사람들에게 미치는 긍정적인 영향에 큰 가치를 둡니다.</li>
        <li><strong>따뜻한 감정:</strong> ENFJ는 감정적으로 민감하며 이해심이 깊습니다. 그들은 다른 사람들의 감정과 관점을 잘 이해하고 존중합니다.</li>
        <li><strong>리더십:</strong> ENFJ는 자신이 속한 커뮤니티나 그룹에서 자주 리더의 역할을 수행합니다. 그들은 리더로서 동정심과 이해심을 발휘하며 다른 사람들을 동기부여합니다.</li>
        </ul>
        <h3>ENFJ의 장점</h3>
        <ul>
        <li><strong>강한 사회적 능력:</strong> ENFJ는 뛰어난 사회성과 의사소통 능력을 가지고 있습니다. 그들은 다른 사람들과 관계를 형성하고 유지하는 데 재능이 있습니다.</li>
        <li><strong>동기부여하는 리더:</strong> ENFJ는 타인을 이해하고 지지하며, 그들의 잠재력을 최대한 이끌어내는 데 능숙합니다.</li>
        <li><strong>감정 이해력:</strong> ENFJ는 자신의 감정과 다른 사람의 감정을 잘 이해하고 이에 따라 행동합니다. 이를 통해 그들은 다른 사람들과 깊이 있는 관계를 형성하는 데 성공하곤 합니다.</li>
        </ul>
        <h3>ENFJ의 단점</h3>
        <ul>
        <li><strong>과도한 책임감:</strong> ENFJ는 때때로 다른 사람들의 문제나 감정을 자신의 것처럼 느끼는 경향이 있습니다. 이로 인해 그들은 스스로에게 지나치게 많은 책임감을 느낄 수 있습니다.</li>
        <li><strong>감정적 과민성:</strong> ENFJ는 감정적으로 민감한 편이며, 자신의 감정이나 다른 사람의 감정에 대해 과도하게 반응하는 경향이 있습니다. 이로 인해 그들은 자신이나 타인의 감정을 잘못 해석하거나 과도하게 걱정하게 될 수 있습니다.</li>
        <li><strong>완벽주의 성향:</strong> ENFJ는 높은 기준을 가지고 있고 완벽을 추구하며, 이러한 성향은 때때로 그들에게 스트레스를 줄 수 있습니다.</li>
        </ul>
    `,
    'ENTP': `
        <h3>ENTP 개요</h3>
        <p>ENTP는 MBTI 성격 유형 중 하나로, 이는 '외향적(E)' '직관적(N)' '사고형(T)' '탐색형(P)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 통찰력이 뛰어나고 창조적이며, 대체로 이해가 빠르고 유연한 사고를 가지고 있습니다.</p>
        <h3>ENTP의 주요 특징</h3>
        <ul>
        <li><strong>창의적이고 통찰력이 뛰어나다:</strong> ENTP는 새로운 아이디어나 개념을 창출하고 이해하는 데 재능이 있습니다. 그들은 다양한 관점에서 문제를 바라보고 복잡한 문제를 해결하는데 능합니다.</li>
        <li><strong>의사소통 능력:</strong> ENTP는 말을 잘하며 다른 사람들과 아이디어를 공유하는 것을 즐깁니다. 그들은 강한 토론을 즐기며, 다른 사람의 관점을 이해하려 노력합니다.</li>
        <li><strong>유연하고 개방적:</strong> ENTP는 새로운 아이디어와 정보에 대한 개방성과 유연성을 가지고 있습니다. 그들은 변화를 즐기며, 고정된 생각에 얽매이지 않는 경향이 있습니다.</li>
        </ul>
        <h3>ENTP의 장점</h3>
        <ul>
        <li><strong>창의적이고 혁신적:</strong> ENTP는 독창적인 생각과 혁신적인 해결책을 제시하는 데 재능이 있습니다. 그들은 기존의 방식에 만족하지 않고, 새로운 접근법을 찾는 것을 즐깁니다.</li>
        <li><strong>뛰어난 문제 해결 능력:</strong> ENTP는 복잡한 문제를 해결하는 데 있어 강한 분석 능력과 직관력을 발휘합니다. 그들은 다양한 가능성을 탐색하고, 창의적인 해결책을 찾아낼 수 있습니다.</li>
        <li><strong>의사소통 스킬:</strong> ENTP는 강한의사소통 능력을 지니고 있어, 자신의 생각을 명확하게 표현하고 다른 사람을 설득하는 데 능숙합니다.</li>
        </ul>
        <h3>ENTP의 단점</h3>
        <ul>
        <li><strong>일관성 부족:</strong> ENTP는 새로운 아이디어나 프로젝트에 쉽게 몰입하지만, 일상적인 업무나 세부사항에는 적은 관심을 보일 수 있습니다. 그들은 종종 시작한 일을 끝내지 않고 다른 일로 이동하는 경향이 있습니다.</li>
        <li><strong>감정적으로 민감하지 않음:</strong> ENTP는 논리와 분석에 초점을 맞추기 때문에, 때때로 다른 사람의 감정을 무시하거나 이해하지 못할 수 있습니다.</li>
        <li><strong>과도한 토론:</strong> ENTP는 토론을 좋아하며, 때때로 이것이 과도하게 이루어질 수 있습니다. 이러한 성향은 다른 사람들에게 부담을 줄 수 있습니다.</li>
        </ul>
        `,
    'ENTJ': `
    <h3>ENTJ 개요</h3>
    <p>ENTJ는 MBTI 성격 유형 중 하나로, 이는 '외향적(E)' '직관적(N)' '사고형(T)' '판단형(J)'의 첫 글자를 따서 만든 약자입니다. 이 유형의 사람들은 대개 강한 리더십을 지니고, 분석적이며 목표 지향적인 경향이 있습니다.</p>
    <h3>ENTJ의 주요 특징</h3>
    <ul>
      <li><strong>분석적이고 논리적:</strong> ENTJ는 문제 해결에 있어 상황을 분석하고 논리적으로 접근하는 경향이 있습니다. 복잡한 상황을 이해하고, 가능한 해결책을 찾는데 유능합니다.</li>
      <li><strong>강한 리더십:</strong> ENTJ는 팀을 이끄는 데 자신감이 있습니다. 효과적인 의사소통과 계획성을 통해 목표를 세우고 이를 달성하는데 집중합니다.</li>
      <li><strong>효율적:</strong> ENTJ는 비효율적인 시스템과 방법론에 큰 불만을 느낄 수 있습니다. 그들은 일반적으로 더 나은 방식을 찾기 위해 자신의 능력을 최대한 활용하려고 노력합니다.</li>
      <li><strong>경쟁적:</strong> ENTJ는 자신의 목표를 성취하는데 있어 열정적이며, 종종 경쟁적인 환경에서 잘 작동합니다.</li>
    </ul>
    <h3>ENTJ의 장점</h3>
    <ul>
      <li><strong>강한 의사결정 능력:</strong> ENTJ는 빠른 판단력과 강한 의사결정 능력을 가지고 있습니다. 이들은 필요한 정보를 기반으로 전략을 세우고, 목표를 달성하기 위한 명확한 계획을 수립하는데 뛰어납니다.</li>
      <li><strong>효과적인 리더:</strong> ENTJ는 자연스러운 리더십 능력과 그룹을 조직하고 관리하는 능력을 지니고 있습니다. 그들은 다른 사람들을 동기부여하고, 팀 목표 달성을 위해 일하는 데 효과적입니다.</li>
      <li><strong>주목받는 소통능력:</strong> ENTJ는 강력한 의사소통 능력을 갖추고 있어, 복잡한 아이디어나 계획을 명확하게 전달하는데 능숙합니다.</li>
    </ul>
    <h3>ENTJ의 단점</h3>
    <ul>
      <li><strong>강도 높은 성향:</strong> ENTJ는 자신의 의견을 강하게 주장하고, 때로는 다른 사람의 입장이나 의견을 무시할 수 있습니다. 이러한 성향 때문에 다른 사람들과 갈등을 일으킬 수 있습니다.</li>
      <li><strong>감정적 요소의 무시:</strong> ENTJ는 논리와 효율성을 중시하기 때문에, 감정적인 요소를 과소평가하거나 무시하는 경향이 있습니다. 이로 인해 다른 사람의 감정을 상처 받게 할 수 있습니다.</li>
      <li><strong>비판에 민감:</strong> ENTJ는 자신의 아이디어와 능력에 대한 비판에 민감하게 반응할 수 있습니다. 이는 그들이 적절한 피드백을 받아들이는 데 어려움을 겪을 수 있음을 의미합니다.</li>
      <li><strong>과도한 요구:</strong> ENTJ는 매우 높은 기준을 가지고 있으며, 때로는 자신과 다른 사람에게 과도한 요구를 할 수 있습니다. 이것은 스트레스와 압박감을 초래할 수 있습니다.</li>
    </ul>
    `
  };
  