<template>
    <h2>내용 요약</h2>
    <ul>
        <li>MBTI에는 특정 기능을 수행하는 8개 유형의 기능이 존재</li>
        <li>각 MBTI 유형별로 강, 약점을 갖는 2개의 기능들을 묶어서 주요 기능, 주요 기능에 포함되지 않는 4개의 기능을 이라고 함</li>
        <li>자기 계발은 아래의 단계로 생각해볼 수 있음
            <ol>
                <li>주요 기능 중 1,2 기능을 인식하여 장점 강화</li>
                <li>주요 기능 중 3,4 기능을 의식하여 단점 보완</li>
                <li>그 외의 4가지 그림자 기능을 의식하여 유연함 강화</li>
            </ol>
        </li>
    </ul>

    <h1>8기능(Cognitive Functions)</h1>
    <p>MBTI의 8가지 기능은 인지 기능이라고도 하며, 이는 개인이 어떻게 정보를 인식하고, 처리하고, 판단을 내리는지를 설명합니다. 이 기능들은 2개의 주 카테고리, 즉 정보를 수집하는 '지각(perception)' 기능과 판단을 내리는 '판단(judging)' 기능으로 나눌 수 있습니다. S/N, F/T에 각각 외향 내향 e/i가 조합되는 방식으로 설명됩니다.</p>
    <h2>8가지 기능</h2>
    <ul>
        <li>Se</li>
        <li>Si</li>
        <li>Ne</li>
        <li>Ni</li>
        <li>Fe</li>
        <li>Fi</li>
        <li>Te</li>
        <li>Ti</li>
    </ul>
    <p>각 기능에 대해서는 별도의 페이지에서 설명하겠습니다.</p>
    <p>사람은 결국 8가지 기능을 전부 사용하기는 하지만, MBTI 유형에 따라 일반적으로 더 자주 사용하고, 덜 사용하는 기능이 있습니다. 8가지 기능을 이해하면 MBTI 유형을 더 잘 이해할 수 있고, 자기 계발에도 활용할 수 있습니다.</p>

    <h2>기능 분류</h2>
    <h3>4개의 주요기능</h3>
    <ul>
        <li><strong>Dominant Function (주기능):</strong> 이것은 각 개인이 세상을 인식하고 이해하는 주된 방식을 나타냅니다. 이는 그 사람이 가장 자연스럽게 사용하고, 그러므로 가장 자주 사용하고 가장 잘 개발된 기능입니다.</li>
        <li><strong>Auxiliary Function (부기능):</strong> 이 기능은 주된 기능을 보완하고 균형을 맞추는데 도움을 줍니다. 보조 기능은 주된 기능만큼 자주 사용되지는 않지만, 여전히 중요한 역할을 합니다.</li>
        <li><strong>Tertiary Function (제3기능):</strong> 이 기능은 개발이 덜 되어 있으며, 때때로 스트레스 상황에서만 나타납니다. 그러나 이 기능은 여전히 개인의 성장과 발전에 중요한 역할을 합니다.</li>
        <li><strong>Inferior Function (열등 기능):</strong> 이 기능은 개인이 가장 적게 사용하며, 따라서 가장 개발이 덜 된 기능입니다. 이 기능은 스트레스가 많거나 피곤한 상황에서 더욱 두드러지게 나타날 수 있습니다. 그럼에도 불구하고, 이 기능을 인식하고 이해하면 개인적 성장과 개발을 위한 중요한 통찰력을 제공할 수 있습니다.</li>
    </ul>

    <h3>4개의 그림자기능</h3>
    <p>그림자 기능의 경우에도 주요기능과 같이 역할을 나누는 경우도 있지만 아직 일반적이지는 않고 해석에 개인차가 있기 때문에 여기선 4개의 그림자 기능을 묶어서 다루겠습니다.</p>

    <h2>MBTI를 기반 자기 계발 단계</h2>
    <ol>
        <li>주기능, 부기능을 인식, 자기의 장점을 강화</li>
        <li>제3기능 열등기능을 의식, 상황에 맞게 사용하여 약점을 보완</li>
        <li>그림자 기능을 의식, 상황에 맞게 사용하여 유연함을 강화</li>
    </ol>
</template>