<template>
  <div>
    <h1>MBTI</h1>
    <p>MBTI(Myers-Briggs Type Indicator)는 작가 캐서린 쿡 브릭스(Katharine C. Briggs)와 그녀의 딸 이자벨 브릭스 마이어스(Isabel B. Myers)가 카를 융의 초기 분석심리학 모델을 바탕으로 1944년에 자신의 성격 유형을 구별하여 각자 적합한 직무를 찾을 목적으로 개발되었습니다. 자기보고형 성격 유형 검사로, 사람의 성격을 16가지의 유형으로 나누어 설명합니다.</p>
    <p>외향-내향(E-I), 감각-직관(S-N), 사고-감정(T-F) 및 판단-인식(J-P)의 4가지 이분법 선호도를 기반으로 개인을 16개의 뚜렷한 성격 유형으로 분류합니다. 엄밀히 얘기하면 성격보다는 하나의 기준에 대해 그 사람이 어떤 것을 ‘더’ 선호하는 것인지를 확인하고, 그 선호의 조합이 갖는 특성을 유형화한 것에 가깝습니다.</p>
    <p>MBTI는 자기 인식을 향상시키고 강점과 약점에 대한 더 나은 이해를 촉진하여 보다 효과적인 개인 및 직업적 상호 작용을 가능하게 하는 것을 목표로 합니다.</p>
    <h2>MBTI에 대한 오해</h2>
    <h3>MBTI는 사이비 과학이다?</h3>
    <p>BIG5 성격 검사와 같이 과학적으로 엄격하지는 않지만 MBTI는 실용적인 통찰력을 제공하며 자기계발 및 다른 사람의 성격을 이해하는 데 널리 사용될 수 있습니다.</p>
    <h3>테스트 결과는 정확하다?</h3>
    <p>자기보고 검사인 MBTI 특성상 응답을 하는 시점의 환경이나 상황에 영향을 받을 수 있습니다. 예를 들어 업무적으로 특정 성향의 행동을 하는 것이 많았다거나 하는 경우에는 실제 본인의 성향과 다르게 그 당시에 익숙한 답변을 할 수 있습니다. 때문에 한 두번의 테스트 결과로 내 유형이다라고 정하기 보다는 각 지표에 대한 설명과 유형에 대한 설명을 읽고 이해를 하면서 찾아나가는 것이 정확합니다.</p>
    <h2>긍정적 활용:</h2>
    <ul>
        <li>여러 성격, 선호 유형을 이해하기 위한 기초적인 원리와 틀로 활용하는 경우</li>
        <li>스스로를 더 깊이 이해하는 데 사용하는 경우</li>
        <li>나와 다른 유형에 대해 더 이해하고 공감하는 것에 활용하는 경우</li>
        <li>이러한 긍정적 활용을 바탕으로 팀플레이나 자기계발, 의사결정에 활용하는 경우</li>
    </ul>
    <h2>부정적 활용:</h2>
    <ul>
        <li>과몰입할 하여 MBTI 유형으로 사람을 지나치게 단순화하거나 고정관념을 갖는 경우</li>
        <li>개인의 경험을 토대로 특정 유형을 비하하거나 혐오에 빠지는 경우</li>
        <li>스스로 개선해야 되는 부분을 유형의 특징이라고 자기합리화하는 경우</li>
        <li>이러한 잘못된 이해를 바탕으로 더 나쁜 판단의 원인이 되는 경우</li>
    </ul>
  </div>
</template>

<script>
export default {
  name: 'MbtiIntro',
}
</script>